In [24]:
import pandas as pd
import os

In [6]:
data_tip=pd.read_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\Tip.csv")

In [7]:
data_tip.head(4)

,user_id,business_id,text,date
0,AGNUgVwnZUey3gcPCJ76iw,3uLgwr0qeCNMjKenHJwPGQ,Avengers time with the ladies.,2012-05-18 02:17:21
1,NBN4MgHP9D3cw--SnauTkA,QoezRbYQncpRqyrLH6Iqjg,They have lots of good deserts and tasty cuban...,2013-02-05 18:35:10
2,-copOvldyKh1qr-vzkDEvw,MYoRNLb5chwjQe3c_k37Gg,It's open even when you think it isn't,2013-08-18 00:56:08
3,FjMQVZjSqY8syIO-53KFKw,hV-bABTK-glh5wj31ps_Jw,Very decent fried chicken,2017-06-27 23:05:38

In [10]:
data_review002=pd.read_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\Review002.csv", nrows=100)

In [11]:
data_review002.head(4)

,review_id,user_id,business_id,stars,useful,funny,cool,text,date
0,KU_O5udG6zpxOg-VcAEodg,mh_-eMZ6K5RLWhZyISBhwA,XQfwVwDr-v0ZS3_CbbE5Xw,3,0,0,0,"If you decide to eat here, just be aware it is...",2018-07-07 22:09:11
1,BiTunyQ73aT9WBnpR9DZGw,OyoGAe7OKpv6SyGZT5g77Q,7ATYjTIgM3jUlt4UM3IypQ,5,1,0,1,I've taken a lot of spin classes over the year...,2012-01-03 15:28:18
2,saUsX_uimxRlCVr67Z4Jig,8g_iMtfSiwikVnbP2etR0A,YjUWPpI6HXG530lwP-fb2A,3,0,0,0,Family diner. Had the buffet. Eclectic assortm...,2014-02-05 20:30:30
3,AqPFMleE6RsU23_auESxiA,_7bHUi9Uuf5__HHc_Q8guQ,kxX2SOes4o-D3ZQBkiMRfA,5,1,0,1,"Wow! Yummy, different, delicious. Our favo...",2015-01-04 00:01:03

Creacion de una mascara parala busqueda de usuarios y analizar si se repite la informacion en el otro dataframe

In [12]:
mascara=data_tip["user_id"]== "_7bHUi9Uuf5__HHc_Q8guQ"
filas_filtradas = data_tip[mascara]
filas_filtradas

,user_id,business_id,text,date
66018,_7bHUi9Uuf5__HHc_Q8guQ,NRl9bD37QQUmdgW8AhUwZw,"Loved the people, food, service, ... everyth...",2014-03-28 17:54:15
302875,_7bHUi9Uuf5__HHc_Q8guQ,ekz_pi9GepaKVT9DE8cUrg,"Delicious, different, definitely going again!",2017-05-02 22:33:24
358792,_7bHUi9Uuf5__HHc_Q8guQ,3tfku-srVI4CJDA9BzacSw,Three of us picked 3 entrees and had so much f...,2014-05-20 17:04:38

Luego de un analisis de los archivos "tip.csv" y "review.csv", se llega a la conclusion que ambos poseen diferentes reviews de locales hechos por usuarios, y se decide unirlos en un solo dataframe.

In [13]:
data_business=pd.read_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\business.csv")

In [14]:
data_business.head(2)

,business_id,name,address,city,state,latitude,longitude,stars,review_count,is_open,categories
0,Pns2l4eNsfO8kk83dixA6A,"Abby Rappoport, LAC, CMQ","1616 Chapala St, Ste 2",Santa Barbara,NaN,34.426679,-119.711197,5.0,7,0,"Doctors, Traditional Chinese Medicine, Naturop..."
1,mpf3x-BjTdTEA3yCZrAYPw,The UPS Store,87 Grasso Plaza Shopping Center,Affton,NaN,38.551126,-90.335695,3.0,15,1,"Shipping Centers, Local Services, Notaries, Ma..."

In [17]:
categorias= ["Restaurant", "Bar", "Pub", "Cafe"]
df_business = data_business[data_business['categories'].str.contains('|'.join(categorias), case=False, na=False)]
df_business.head(2)

,business_id,name,address,city,state,latitude,longitude,stars,review_count,is_open,categories
3,MTSW4McQd7CbVtyjqoe9mw,St Honore Pastries,935 Race St,Philadelphia,CA,39.955505,-75.155564,4.0,80,1,"Restaurants, Food, Bubble Tea, Coffee & Tea, B..."
4,mWMc6_wTdE0EUBKIGXDVfA,Perkiomen Valley Brewery,101 Walnut St,Green Lane,MO,40.338183,-75.471659,4.5,13,1,"Brewpubs, Breweries, Food"

In [19]:
df_business.to_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\info-locales.csv", index=False)

Se filtran por las categorias que solo se van a utilizar para el analisis final "["Restaurant", "Bar", "Pub", "Cafe"]"

Se analiza archivo de User-001 y checkin

In [20]:
df_user001=pd.read_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\user-001.csv")

In [22]:
df_user001.head(4)

,user_id,name,review_count,yelping_since,useful,funny,cool,fans,average_stars
0,qVc8ODYU5SZjKXVBgXdI7w,Walker,585,2007-01-25 16:47:26,7217,1259,5994,267,3.91
1,j14WgRoU_-2ZE1aw1dXrJg,Daniel,4333,2009-01-25 04:35:42,43091,13066,27281,3138,3.74
2,2WnXYQFK0hXEoTxPtV2zvg,Steph,665,2008-07-25 10:41:00,2086,1010,1003,52,3.32
3,SZDeASXq7o05mMNLshsdIA,Gwen,224,2005-11-29 04:38:33,512,330,299,28,4.27

In [21]:
df_checkin=pd.read_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\checkin.csv")

In [23]:
df_checkin.head(4)

              business_id                                               date
0  ---kPU91CF4Lq2-WlRu9Lw  2020-03-13 21:10:56, 2020-06-02 22:18:06, 2020...
1  --0iUa4sNDFiZFrAdIWhZQ  2010-09-13 21:43:09, 2011-05-04 23:08:15, 2011...
2  --30_8IhuyMHbSOcNWd6DQ           2013-06-14 23:29:17, 2014-08-13 23:20:22
3  --7PUidqRWpRSpXebiyxTg  2011-02-15 17:12:00, 2011-07-28 02:46:10, 2012...

Debido a la informacion irrelevante para el analisis que posee el archivo "chekin" se procede a eliminarlo del datawarehouse

In [25]:
os.remove(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\checkin.csv")

Luego de un analisis final, se pueden observar 3 patrones referidos a
Informacion precisa de locales:
    -business.csv
Informacion sobre usuarios:
    -user-001.csv
Informacion sobre los comentarios:
    -tip.csv
    -review-002.csv

Apertura del archivo "review-002.json"en su totalidad

In [29]:
import json
import pandas as pd

# Lista para almacenar los datos
datos_review = []

# Ruta al archivo JSON
ruta_archivo = r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataLake\YELP\review-002.json"

# Abrir el archivo JSON y leer cada línea
with open(ruta_archivo, 'r', encoding='utf-8') as archivo:
    for linea in archivo:
        # Intentar cargar el objeto JSON de la línea
        try:
            objeto_json = json.loads(linea)
            datos_review.append(objeto_json)
        except json.JSONDecodeError as e:
            print(f"Error al decodificar JSON en línea: {e}")

# Crear un DataFrame a partir de los datos
df_review = pd.DataFrame(datos_review)

# Mostrar las primeras filas del DataFrame
print(df_review.head())

                review_id                 user_id             business_id  \
0  KU_O5udG6zpxOg-VcAEodg  mh_-eMZ6K5RLWhZyISBhwA  XQfwVwDr-v0ZS3_CbbE5Xw
1  BiTunyQ73aT9WBnpR9DZGw  OyoGAe7OKpv6SyGZT5g77Q  7ATYjTIgM3jUlt4UM3IypQ
2  saUsX_uimxRlCVr67Z4Jig  8g_iMtfSiwikVnbP2etR0A  YjUWPpI6HXG530lwP-fb2A
3  AqPFMleE6RsU23_auESxiA  _7bHUi9Uuf5__HHc_Q8guQ  kxX2SOes4o-D3ZQBkiMRfA
4  Sx8TMOWLNuJBWer-0pcmoA  bcjbaE6dDog4jkNY91ncLQ  e4Vwtrqf-wpJfwesgvdgxQ

   stars  useful  funny  cool  \
0    3.0       0      0     0
1    5.0       1      0     1
2    3.0       0      0     0
3    5.0       1      0     1
4    4.0       1      0     1

                                                text                 date
0  If you decide to eat here, just be aware it is...  2018-07-07 22:09:11
1  I've taken a lot of spin classes over the year...  2012-01-03 15:28:18
2  Family diner. Had the buffet. Eclectic assortm...  2014-02-05 20:30:30
3  Wow!  Yummy, different,  delicious.   Our favo...  2015-01-04 00:01:03
4  Cute interior and owner (?) gave us tour of up...  2017-01-14 20:54:15

In [30]:
df_review.to_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\reviews.csv", index=False)

Filtrado por categorias que vamos a utilizar "restaurant, bar, pub, cafe"

In [32]:
categorias_deseadas = ["restaurant", "bar", "pub", "cafe"]
df_business = df_business[df_business['categories'].str.contains('|'.join(categorias_deseadas), case=False)]

Union de los datasets, de comentarios con la informacion de cada local, y posterior guardado en archivo listo para su consumo

In [33]:
df_combinado1 = pd.merge(df_review, df_business, on='business_id', how='inner')

In [37]:
df_combinado1.drop(columns=["review_id", "useful", "funny", "cool", "is_open"], inplace=True)

In [39]:
df_combinado2 = pd.merge(data_tip, df_business, on='business_id', how='inner')

In [ ]:
df_combinado2.drop(columns="is_open").rename(columns={"stars":"stars_y"})

In [44]:
df_concatenado = pd.concat([df_combinado1, df_combinado2], ignore_index=True)

In [51]:
df_concatenado.rename(columns={"stars_x":"stars_comment", "stars_y":"stars_local"}, inplace=True)

In [55]:
df_concatenado['stars_business'] = df_concatenado['stars_local'].combine_first(df_concatenado['stars'])

In [57]:
df_concatenado.drop(columns=["stars_local", "stars", "is_open"], inplace=True)

In [58]:
df_concatenado.head(2)

,user_id,business_id,stars_comment,text,date,name,address,city,state,latitude,longitude,review_count,categories,stars_business
0,mh_-eMZ6K5RLWhZyISBhwA,XQfwVwDr-v0ZS3_CbbE5Xw,3.0,"If you decide to eat here, just be aware it is...",2018-07-07 22:09:11,Turning Point of North Wales,1460 Bethlehem Pike,North Wales,PA,40.210196,-75.223639,169,"Restaurants, Breakfast & Brunch, Food, Juice B...",3.0
1,Iaee7y6zdSB3B-kRCo4z1w,XQfwVwDr-v0ZS3_CbbE5Xw,2.0,This is the second time we tried turning point...,2017-05-13 17:06:55,Turning Point of North Wales,1460 Bethlehem Pike,North Wales,PA,40.210196,-75.223639,169,"Restaurants, Breakfast & Brunch, Food, Juice B...",3.0

In [59]:
df_concatenado.to_csv(r"C:\Users\Usuario\Desktop\GitHub\DataSets\DataWarehouse\Yelp-CF.csv", index=False)